'''
Условие
Требуется написать программу, которая печатает "Hello, world!" (без кавычек)
'''
print ('Hello, world!')