'''
Условие
Требуется написать программу, которая печатает все цвета радуги на русском языке.
Каждый цвет вывести в отдельной строке с большой буквы.
'''
print ('Красный')
print ('Оранжевый')
print ('Желтый')
print ('Зеленый')
print ('Голубой')
print ('Синий')
print ('Фиолетовый')